[{
		"name": "The Legacy",
		"thumbnail": "https://raw.githubusercontent.com/SlavaWRX/CarsTableView/master/Images/The%20Legacy%20100x100.png",
		"photo": "http://fethica.github.io/UITableViewJSON/images/profile/naruto.png",
		"description": "The WRX story starts with the Impreza's predecessor, the Legacy. In 1989, Subaru broke the world record for long distance high speed runs in Arizona by covering 100,000 kilometers (62,137 miles) in 447 hours, 44 minutes and 9.887 (not 10!) seconds. That's an average speed of 138.77 mph. What's even better is that in Japan, you could get the RS version with a five-speed manual and the 2.0-liter EJ20G turbo engine producing 220 horsepower and 200 foot pounds. In a slightly modified form, this (EJ20F4) went into the first Impreza WRX."
	},
	{
		"name": "First WRX",
		"thumbnail": "http://fethica.github.io/UITableViewJSON/images/thumbs/sasuke.png",
		"photo": "http://fethica.github.io/UITableViewJSON/images/profile/sasuke.jpg",
		"description": "The WRX was introduced in 1992 with the sedan and wagon body styles. While it was powered by a 240 horsepower 2.0-liter boxer engine in Japan, Europe had to make do with only 210. Still, we were better off than North-America, as the first generation WRX never made it there. Also for the Japanese domestic market, a stripped-down RA version was available for those who wanted to build a race car with manual windows, no ABS, less soundproofing, shorter gears and a Nardi steering wheel."
	},
	{
		"name": "RA",
		"thumbnail": "http://fethica.github.io/UITableViewJSON/images/thumbs/sakura.png",
		"photo": "http://fethica.github.io/UITableViewJSON/images/profile/sakura.jpg",
		"description": "The WRX was turned up to 11 in February 1994 when Subaru introduced the STI version. They entered the World Rally Championship with Colin McRae behind the wheel, who had proven himself with a Legacy before. These STIs were first converted from regular WRXs at the Subaru factory. The modifications were mostly mechanical, so that the STIs ended up with 250 horses, stronger suspension and transmission, and in case of the lightweight RA edition, an electromechanical differential as well.In 1996, the GC8D was introduced with updated styling and more power.By the time Subaru came out with the second generation, even the normal WRXs had 240 horses in JDM tune."
	},
	{
		"name": "Horse",
		"thumbnail": "http://fethica.github.io/UITableViewJSON/images/thumbs/kakashi.png",
		"photo": "http://fethica.github.io/UITableViewJSON/images/profile/kakashi.jpg",
		"description": "The horse new Impreza WRX wasn't a success as far as the design goes, but with 250 horsepower coming from that boxer, buyers could forgive easily. Also, America got the car finally, even if that only had 227 horses. With the four-speed automatic, this was more about traction than speed anyway."
	},
	{
		"name": "The Fox",
		"thumbnail": "http://fethica.github.io/UITableViewJSON/images/thumbs/neji.png",
		"photo": "http://fethica.github.io/UITableViewJSON/images/profile/neji.png",
		"description": "The next facelift came when the STI was introduced to America in 2004. Since Subaru won the World Rally Championship in both 2001 and 2003, everybody wanted blue Imprezas with golden wheels. It was tweaked again in 2006, proving once again that Subaru had serious issues when it came to the styling. The engine was changed to the 2.5-liter turbocharged intercooled EJ255 unit for more torque and 230 horsepower. The WRX ran on 17 wheels now, and got fatter."
	},
	{
		"name": "Chōji Akimichi",
		"thumbnail": "http://fethica.github.io/UITableViewJSON/images/thumbs/choji.png",
		"photo": "http://fethica.github.io/UITableViewJSON/images/profile/choji.png",
		"description": "Chōji was born into the Akimichi clan, and is slated to become the Sixteenth head of the Akimichi (秋道16代目当主, Akimichi Jūrokudaime Tōshu) after his father, Chōza. When Chōji was younger, he was often put down for not being good at a child's game called \"Ninja\", which appears to be a cross between tag and hide and seek, often employing the use of shuriken made out of cardboard and sticks. His peers would always berate him, telling him that any team that he was on was bound to lose. One day, they simply refused to let him play at all. However, Shikamaru stuck up for him, saying that the teams would be uneven if Chōji didn't join them. This gave Chōji a little hope, although, in the end, they still refused to let him play."
	},
	{
		"name": "Mainstream",
		"thumbnail": "http://fethica.github.io/UITableViewJSON/images/thumbs/garaa.png",
		"photo": "http://fethica.github.io/UITableViewJSON/images/profile/garaa.jpg",
		"description": "For the 2008 model year, Subaru gave the Impreza lineup a radical redesign that made it larger and more in-line with competition like the Mazda3. It also sought to make the WRX more mainstream with a softened suspension and a far less ostentatious body than its predecessors. The car could still haul ass, as power remained at 227 horsepower, but the hoonage-loving fans were outraged. The boxier, more powerful STI version — which controversially came only as a hatchback —fared better, though it was far less hardcore than its predecessors."
	},
	{
		"name": "Pokemon",
		"thumbnail": "http://fethica.github.io/UITableViewJSON/images/thumbs/hinata.jpg",
		"photo": "http://fethica.github.io/UITableViewJSON/images/profile/hinata.jpg",
		"description": "Realizing that a car for crazy people like the WRX should never go mainstream, Subaru realized their mistake and upgraded the suspension for the 2009 model year. They also bumped power to 265 horses. In 2011, the widebody kit from the STI was added to the WRX, and the sedan STI was brought back."
	}
]
